sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/controller/stm32wb05n_l2cap_aci.c
/**
  ******************************************************************************
  * @file    stm32wb05n_l2cap_aci.c
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version V1.3.0
  * @date    06-Feb-2024
  * @brief   Source file for external uC - STM32WB05N in network coprocessor mode (l2cap_aci)
  *          Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "ble_types.h"
#include "stm32wb05n_l2cap_aci.h"
#include "hci_tl.h"

tBleStatus aci_l2cap_connection_parameter_update_req(uint16_t Connection_Handle,
                                                     uint16_t Connection_Interval_Min,
                                                     uint16_t Connection_Interval_Max,
                                                     uint16_t Peripheral_Latency,
                                                     uint16_t Timeout_Multiplier)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_connection_parameter_update_req_cp0 *cp0 = (aci_l2cap_connection_parameter_update_req_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Connection_Interval_Min = htob(Connection_Interval_Min, 2);
  index_input += 2;
  cp0->Connection_Interval_Max = htob(Connection_Interval_Max, 2);
  index_input += 2;
  cp0->Peripheral_Latency = htob(Peripheral_Latency, 2);
  index_input += 2;
  cp0->Timeout_Multiplier = htob(Timeout_Multiplier, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x181;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_l2cap_connection_parameter_update_resp(uint16_t Connection_Handle,
                                                      uint16_t Connection_Interval_Min,
                                                      uint16_t Connection_Interval_Max,
                                                      uint16_t Peripheral_Latency,
                                                      uint16_t Timeout_Multiplier,
                                                      uint16_t Min_CE_Length,
                                                      uint16_t Max_CE_Length,
                                                      uint8_t Identifier,
                                                      uint8_t Accept)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_connection_parameter_update_resp_cp0 *cp0 = (aci_l2cap_connection_parameter_update_resp_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Connection_Interval_Min = htob(Connection_Interval_Min, 2);
  index_input += 2;
  cp0->Connection_Interval_Max = htob(Connection_Interval_Max, 2);
  index_input += 2;
  cp0->Peripheral_Latency = htob(Peripheral_Latency, 2);
  index_input += 2;
  cp0->Timeout_Multiplier = htob(Timeout_Multiplier, 2);
  index_input += 2;
  cp0->Min_CE_Length = htob(Min_CE_Length, 2);
  index_input += 2;
  cp0->Max_CE_Length = htob(Max_CE_Length, 2);
  index_input += 2;
  cp0->Identifier = htob(Identifier, 1);
  index_input += 1;
  cp0->Accept = htob(Accept, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x182;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_l2cap_cos_connection_req(uint16_t Connection_Handle,
                                        uint16_t SPSM,
                                        uint16_t MTU,
                                        uint16_t MPS,
                                        uint8_t Channel_Type,
                                        uint8_t CID_Count)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_cos_connection_req_cp0 *cp0 = (aci_l2cap_cos_connection_req_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->SPSM = htob(SPSM, 2);
  index_input += 2;
  cp0->MTU = htob(MTU, 2);
  index_input += 2;
  cp0->MPS = htob(MPS, 2);
  index_input += 2;
  cp0->Channel_Type = htob(Channel_Type, 1);
  index_input += 1;
  cp0->CID_Count = htob(CID_Count, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x183;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_l2cap_cos_connection_resp(uint16_t Connection_Handle,
                                         uint8_t Identifier,
                                         uint16_t MTU,
                                         uint16_t MPS,
                                         uint16_t Result,
                                         uint8_t CID_Count,
                                         uint16_t CID[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_cos_connection_resp_cp0 *cp0 = (aci_l2cap_cos_connection_resp_cp0*)(cmd_buffer);
  aci_l2cap_cos_connection_resp_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Identifier = htob(Identifier, 1);
  index_input += 1;
  cp0->MTU = htob(MTU, 2);
  index_input += 2;
  cp0->MPS = htob(MPS, 2);
  index_input += 2;
  cp0->Result = htob(Result, 2);
  index_input += 2;
  cp0->CID_Count = htob(CID_Count, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x184;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  STM32WB_memcpy((void *) CID, (const void *) resp.CID, CID_Count*sizeof(uint16_t));
  return BLE_STATUS_SUCCESS;
}

tBleStatus aci_l2cap_cos_flow_control_credits_ind(uint16_t Connection_Handle,
                                                  uint16_t CID,
                                                  uint16_t RX_Credits,
                                                  uint8_t CFC_Policy,
                                                  uint16_t *RX_Credit_Balance)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_cos_flow_control_credits_ind_cp0 *cp0 = (aci_l2cap_cos_flow_control_credits_ind_cp0*)(cmd_buffer);
  aci_l2cap_cos_flow_control_credits_ind_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->CID = htob(CID, 2);
  index_input += 2;
  cp0->RX_Credits = htob(RX_Credits, 2);
  index_input += 2;
  cp0->CFC_Policy = htob(CFC_Policy, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x185;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *RX_Credit_Balance = btoh(resp.RX_Credit_Balance, 2);
  return BLE_STATUS_SUCCESS;
}

tBleStatus aci_l2cap_cos_disconnect_req(uint16_t Connection_Handle,
                                        uint16_t CID)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_cos_disconnect_req_cp0 *cp0 = (aci_l2cap_cos_disconnect_req_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->CID = htob(CID, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x186;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_l2cap_cos_sdu_data_transmit(uint16_t Connection_Handle,
                                           uint16_t CID,
                                           uint16_t SDU_Length,
                                           uint8_t SDU_Data[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_cos_sdu_data_transmit_cp0 *cp0 = (aci_l2cap_cos_sdu_data_transmit_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->CID = htob(CID, 2);
  index_input += 2;
  cp0->SDU_Length = htob(SDU_Length, 2);
  index_input += 2;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->SDU_Data, (const void *) SDU_Data, SDU_Length*sizeof(uint8_t));
    index_input += SDU_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x187;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_l2cap_cos_reconfigure_req(uint16_t Connection_Handle,
                                         uint16_t MTU,
                                         uint16_t MPS,
                                         uint8_t CID_Count,
                                         uint16_t CID[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_cos_reconfigure_req_cp0 *cp0 = (aci_l2cap_cos_reconfigure_req_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->MTU = htob(MTU, 2);
  index_input += 2;
  cp0->MPS = htob(MPS, 2);
  index_input += 2;
  cp0->CID_Count = htob(CID_Count, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->CID, (const void *) CID, CID_Count*sizeof(uint16_t));
    index_input += CID_Count*sizeof(uint16_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x18a;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_l2cap_cos_reconfigure_resp(uint16_t Connection_Handle,
                                          uint8_t Identifier,
                                          uint16_t Result)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_l2cap_cos_reconfigure_resp_cp0 *cp0 = (aci_l2cap_cos_reconfigure_resp_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Identifier = htob(Identifier, 1);
  index_input += 1;
  cp0->Result = htob(Result, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x18b;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
